package com.student.server.toDo;

public class ToDo {

    //解决注册和忘记密码公用success和error页面问题

    //解决result存储信息得关键字导致得返回按钮得问题

    //解决忘记密码后数据库密码更改，但是redis依然存有旧的密码导致登录不进去问题

    //修改密码失效问题

    //完成注册，忘记密码，修改密码等返回的成功及失败页面得规范性

    //以上已解决

    //20260404

    //解决数据直接插入但是登录不进去的问题，

    //解决删除数据库用户和缓存用户以及缓存里面的登录信息残留问题,也就是session写入redis的时候key设置为studentNum；

    //20260407

    //解决输入内容转义问题

    //解决分页查询和实现赖加载

    //20260418

    //解决发布评论后昵称失效问题

    //实现session失效后跳转到login

    //请求头参数封装为application/json

    //20260424
    //选课中心查不到数据

    //20260427
    //将选课信息写入redis
    //评论系统子评论无法挂载到父评论
    //有空的时候，把所有的localstorage全部都改成sessionStorage

    //20260430
    //删除status

    //20260503
    //解决压测失效问题
    //lua脚本学习

    //20260506
    //解决redis里面意外出现的分布式ID键值对

    //20260507
    //解决由于事务回滚导致的redis数据扣减与数据库不一致
    //前后端改用axios调用不用fetch调用
}
